package VariableAndIf_1;

//Написать стишок из 4х строк используя sout только 2 раза

public class TaskA2 {
    public static void main(String[] args) {
        String a = "Хоп";
        String b = "Хэй";
        String c = "Лала";
        String d = "Лэй";
        System.out.println("Моё любимое стихотворение:");
        System.out.println(a + "\n" + b + "\n" + c + "\n" + d);
    }
}
